app/controllers/api/v1/users_controller.rb

SELECT "users"."id", "users"."email", "users"."username" FROM "users"
---
      def index
        render status: 200, json: {
          success: true,
          data: User.all.select(:id, :email, :username).as_json

INSERT INTO "users" ("email", "password", "username", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["email", "email@gmal.com"], ["password", "[FILTERED]"], ["username", "hinga"], ["created_at", "2023-10-19 04:15:23.283762"], ["updated_at", "2023-10-19 04:15:23.283762"]]
---
      def create
        user = User.new(permitted_params)
        if user.valid? && user.save

SELECT "users".* FROM "users" WHERE "users"."email" = $1 AND "users"."password" = $2 ORDER BY "users"."id" ASC LIMIT $3  [["email", "email@gmal.com"], ["password", "[FILTERED]"], ["LIMIT", 1]]
---
      def login
        user = User.where(email: permitted_params[:email], password: permitted_params[:password]).first